jmeter/report-all-users/statistics.json
{
  "推荐列表-并发遍历" : {
    "transaction" : "推荐列表-并发遍历",
    "sampleCount" : 310,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.245161290322577,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 8.779999999999973,
    "throughput" : 67.02702702702702,
    "receivedKBytesPerSec" : 269.0899493243243,
    "sentKBytesPerSec" : 10.061233108108109
  },
  "收件箱-遍历用户索引统计" : {
    "transaction" : "收件箱-遍历用户索引统计",
    "sampleCount" : 304,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.8322368421052642,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 137.49434644957034,
    "receivedKBytesPerSec" : 47.71464057553143,
    "sentKBytesPerSec" : 19.28744063772049
  },
  "收件箱-遍历用户缓存查看" : {
    "transaction" : "收件箱-遍历用户缓存查看",
    "sampleCount" : 304,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.8026315789473695,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 138.4335154826958,
    "receivedKBytesPerSec" : 43.531296248861565,
    "sentKBytesPerSec" : 19.959941370673953
  },
  "推荐列表-高并发遍历" : {
    "transaction" : "推荐列表-高并发遍历",
    "sampleCount" : 350,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.7942857142857127,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 9.0,
    "throughput" : 35.637918745545264,
    "receivedKBytesPerSec" : 143.07371480755523,
    "sentKBytesPerSec" : 5.324806218816821
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1876,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.088486140724949,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 911.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 12.0,
    "throughput" : 94.98253252999848,
    "receivedKBytesPerSec" : 267.91028777023945,
    "sentKBytesPerSec" : 14.076027796060957
  },
  "推荐列表-遍历用户" : {
    "transaction" : "推荐列表-遍历用户",
    "sampleCount" : 304,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.506578947368421,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 911.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 12.75,
    "pct3ResTime" : 19.899999999999977,
    "throughput" : 98.73335498538486,
    "receivedKBytesPerSec" : 396.352115642254,
    "sentKBytesPerSec" : 14.910736034426762
  },
  "收件箱-遍历用户降级推荐" : {
    "transaction" : "收件箱-遍历用户降级推荐",
    "sampleCount" : 304,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.391447368421053,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 5.949999999999989,
    "throughput" : 138.55970829535096,
    "receivedKBytesPerSec" : 556.2297921889243,
    "sentKBytesPerSec" : 21.33125854603464
  }
}